Revit 2026 API

# BumpMapBumpmapDepth Property

---

The property labeled "Amount" from the "BumpMap" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string BumpmapDepth { get; }
```
```vb
Public Shared ReadOnly Property BumpmapDepth As String
	Get
```
```cpp
public:
static property String^ BumpmapDepth {
	String^ get ();
}
```
```fsharp
static member BumpmapDepth : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDistance".

#### Reference

BumpMap Class

Autodesk.Revit.DB.Visual Namespace